БухЭксп/Catalogs/CW_Коносаменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Коносаменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Букинг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКоносамента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыКоносаментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Извещать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзвещатьАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИзвещатьНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Линия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Линии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправительНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортПерегрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Порты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Рейсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Судно</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Суда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминалВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминалОтправки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТерминалПерегрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Терминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКоносамента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыКоносаментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Доставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГрузоотправителиИГрузополучатели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоставкаНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогрузкиНаСудно</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрузовыеЕдиницы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеГрузовойЕдиницы</Name>
							<Comment>Наименование грузовой единицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Типоразмер</Name>
							<Comment>Типоразмер контейнера</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Comment>Наименование упаковки груза в грузовой единице </Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУпаковок</Name>
							<Comment>Количество упаковок в грузовой единице</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>9</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пломба</Name>
							<Comment>Номер пломбы грузовой единицы</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеГруза</Name>
							<Comment>Описание груза </Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесТары</Name>
							<Comment>Вес тары в килограммах</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесНетто</Name>
							<Comment>Нетто вес груза</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВесБрутто</Name>
							<Comment>Брутто вес груза</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объем</Name>
							<Comment>Объем груза в м3</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГармонизированныйКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлассОпасности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_КлассификаторОпасныхГрузов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Груз</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ГрузоперевозкиКоносаментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ГрузоперевозкиКоносаментов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_ТипыКоносаментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ТипыКоносаментов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетДоговораСКлиентом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЗаказов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетЗаявок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетКонтейнеров</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПортаПерегрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетГармонизированногоКода</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетКлассаОпасности</Name>
					<Comment>Учет класса опасности груза по классификации IMO (International Maritime Organization, Международная морская организация) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетГруза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеРеквизитовМониторинговымПараметрам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>РеквизитКоносамента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_РеквизитыКоносамента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрОбъекта</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КопироватьВГрузоперевозки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КопироватьВЗаказы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_Коносаменты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если ЗначениеЗаполнено(Объект.Рейс) Тогда
		УстановитьПорты();  
	КонецЕсли;  
	
	Если ТипЗнч(Порты) = Тип("ФиксированныйМассив") Тогда  
		Элементы.ПортОтправки.СписокВыбора.Очистить(); 
		Элементы.ПортОтправки.СписокВыбора.ЗагрузитьЗначения(Новый Массив(Порты));  
		
		Элементы.ПортПерегрузки.СписокВыбора.Очистить(); 
		Элементы.ПортПерегрузки.СписокВыбора.ЗагрузитьЗначения(Новый Массив(Порты));
		
		Элементы.ПортВыгрузки.СписокВыбора.Очистить(); 
		Элементы.ПортВыгрузки.СписокВыбора.ЗагрузитьЗначения(Новый Массив(Порты));
	КонецЕсли;
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.Дата = ТекущаяДата();	
		Если ЗначениеЗаполнено(Объект.Рейс) Тогда
			Если ТипЗнч(Порты) = Тип("ФиксированныйМассив") Тогда  
				Если ЗначениеЗаполнено(Объект.ПортОтправки) Тогда
					УстановитьТерминал(Объект.ПортОтправки, "ТерминалОтправки");
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ПортПерегрузки) Тогда
					УстановитьТерминал(Объект.ПортПерегрузки, "ТерминалПерегрузки");
				КонецЕсли;
				Если ЗначениеЗаполнено(Объект.ПортВыгрузки) Тогда
					УстановитьТерминал(Объект.ПортВыгрузки, "ТерминалВыгрузки");
				КонецЕсли; 
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли;
	
	CW_МониторинговыеПараметрыСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	УстановитьПараметрыФункциональныхОпций();
	
	//Наличие прикрепленных файлов
	_УФКС.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	//Наличие прикрепленных файлов
	
	УстановитьОтборДинамическихСписков();
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УстановитьПорты(); 
	УстановитьСписокГрузоперевозокВСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)  
	
	CW_МониторинговыеПараметрыКлиент.ВосстановитьСостояниеГрупп(ЭтаФорма);  
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "Запись_Рейсы" Тогда
		УстановитьПорты();
		//Наличие прикрепленных файлов
	ИначеЕсли ИмяСобытия = "ОбновитьНаличиеПрикрепленныхФайлов" Тогда
		
		ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов();
		//Наличие прикрепленных файлов
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	CW_МониторинговыеПараметрыСервер.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
	
	УстановитьОтборДинамическихСписков();
	УстановитьПараметрыФункциональныхОпций();
	УстановитьСписокГрузоперевозокВСтроки();
	
КонецПроцедуры   

&НаСервере
Процедура УстановитьПараметрыФункциональныхОпций()
	
	УстанавлваемыеПараметры = Новый Структура;
	УстанавлваемыеПараметры.Вставить("CW_ТипКоносамента", Объект.ТипКоносамента);
	
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавлваемыеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипКоносаментаПриИзменении(Элемент)
	
	ДанныеРеквизита = ПолучитьДанныеРеквизита();
	CW_МониторинговыеПараметрыКлиент.ЗаполнитьПоТипу(ЭтаФорма, ДанныеРеквизита);
	
	УстановитьПараметрыФункциональныхОпций();
	
КонецПроцедуры

&НаКлиенте
Процедура РейсПриИзменении(Элемент)
	
	УстановитьПорты();
	
КонецПроцедуры



&НаКлиенте
Процедура МониторинговыеПараметрыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	CW_МониторинговыеПараметрыКлиент.ПередНачаломДобавленияПараметров(ЭтаФорма, Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВверх(Команда)   
	
	CW_МониторинговыеПараметрыКлиент.ПереместитьЭлемент(ЭтаФорма, -1);
	
КонецПроцедуры

&НаКлиенте
Процедура ПереместитьВниз(Команда)
	
	CW_МониторинговыеПараметрыКлиент.ПереместитьЭлемент(ЭтаФорма, 1);
	
КонецПроцедуры  

&НаКлиенте
Процедура СвернутьВсе(Команда)  
	
	CW_МониторинговыеПараметрыКлиент.СвернутьГруппыПараметров(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда) 
	
	CW_МониторинговыеПараметрыКлиент.РазвернутьГруппыПараметров(ЭтаФорма);
	
КонецПроцедуры  

&НаКлиенте
Процедура ВосстановитьСостояниеГрупп(Команда)
	
	CW_МониторинговыеПараметрыКлиент.ВосстановитьСостояниеГрупп(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоТипуКоносамента(Команда)  
	
	ДанныеРеквизита = ПолучитьДанныеРеквизита();
	CW_МониторинговыеПараметрыКлиент.ЗаполнитьПоТипу(ЭтаФорма, ДанныеРеквизита);
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьДанныеРеквизита()  
	
	ДанныеРеквизита = Новый Структура;
	ДанныеРеквизита.Вставить("Имя", 	"ТипКоносамента");
	ДанныеРеквизита.Вставить("Синоним", "тип коносамента");
	
	Возврат ДанныеРеквизита;
	
КонецФункции

&НаСервере
Процедура УстановитьОтборДинамическихСписков()
	
	ПравоеЗначение = ?(Объект.Ссылка.Пустая(), Неопределено, Объект.Ссылка);
	
	Заказы.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Заказы.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Коносамент");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение 	= ПравоеЗначение;
	
	
	Грузоперевозки.Отбор.Элементы.Очистить();
	
	ЭлементОтбора = Грузоперевозки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Коносамент");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.Использование 	= Истина;
	ЭлементОтбора.РежимОтображения 	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ПравоеЗначение 	= ПравоеЗначение;
	
КонецПроцедуры


&НаКлиенте
Процедура ПортОтправкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	
	УстановитьСписокПотры(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПортПерегрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	УстановитьСписокПотры(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПортВыгрузкиНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	УстановитьСписокПотры(Элемент, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСписокПотры(Элемент, СтандартнаяОбработка)
	
	Элемент.СписокВыбора.Очистить(); 
	
	Если ТипЗнч(Порты) <> Тип("ФиксированныйМассив") Тогда  
		СтандартнаяОбработка = ложь;
		Возврат;
	КонецЕсли;
	
	МассивПорты = Новый Массив(Порты);    
	Элемент.СписокВыбора.ЗагрузитьЗначения(МассивПорты);
	
КонецПроцедуры    

&НаСервере
Процедура УстановитьПорты()
	
	Если Не ЗначениеЗаполнено(Объект.Рейс) Тогда
		Возврат;
	КонецЕсли; 
	
	СоответствиеПортыТерминалы = Новый Соответствие;
	МассивПорты = Новый Массив;
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	CW_РейсыЗаходы.Порт КАК Порт,
	|	CW_РейсыЗаходы.Терминал КАК Терминал
	|ИЗ
	|	Справочник.CW_Рейсы.Заходы КАК CW_РейсыЗаходы
	|ГДЕ
	|	CW_РейсыЗаходы.Ссылка = &Рейс"; 
	
	Запрос.УстановитьПараметр("Рейс", Объект.Рейс);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеПортыТерминалы.Вставить(Выборка.Порт, Выборка.Терминал);   
		
		Если МассивПорты.Найти(Выборка.Порт) = Неопределено Тогда
			МассивПорты.Добавить(Выборка.Порт);                 
		КонецЕсли;
	КонецЦикла;
	
	Порты = Новый ФиксированныйМассив(МассивПорты);
	ПортыТерминалы = Новый ФиксированноеСоответствие(СоответствиеПортыТерминалы);
	
КонецПроцедуры


&НаКлиенте
Процедура ПортОтправкиПриИзменении(Элемент)
	
	УстановитьТерминал(Объект.ПортОтправки, "ТерминалОтправки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПортПерегрузкиПриИзменении(Элемент) 
	
	УстановитьТерминал(Объект.ПортПерегрузки, "ТерминалПерегрузки");
	
КонецПроцедуры


&НаКлиенте
Процедура ПортВыгрузкиПриИзменении(Элемент)
	
	УстановитьТерминал(Объект.ПортВыгрузки, "ТерминалВыгрузки");
	
КонецПроцедуры  

&НаСервере
Процедура УстановитьТерминал(Знач Порт, Знач ИмяРеквизита)
	
	Объект[ИмяРеквизита] = ПортыТерминалы.Получить(Порт);
	
КонецПроцедуры


&НаКлиенте
Процедура ОтправительПриИзменении(Элемент) 
	
	Если ЗначениеЗаполнено(Объект.Отправитель) Тогда 
		Данные = ГрузоотправителиИГрузополучателиПолучитьДанные(Объект.Отправитель);
		ЗаполнитьНаименованиеИАдрес("Отправитель", Данные); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправительЗаполнитьДанные(Команда)
	
	Данные = ГрузоотправителиИГрузополучателиПолучитьДанные(Объект.Отправитель);
	ЗаполнитьНаименованиеИАдрес("Отправитель", Данные);   
	
КонецПроцедуры


&НаКлиенте
Процедура ПолучательПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Получатель) Тогда 
		Данные = ГрузоотправителиИГрузополучателиПолучитьДанные(Объект.Получатель);
		ЗаполнитьНаименованиеИАдрес("Получатель", Данные); 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПолучательЗаполнитьДанные(Команда)
	
	Данные = ГрузоотправителиИГрузополучателиПолучитьДанные(Объект.Получатель);
	ЗаполнитьНаименованиеИАдрес("Получатель", Данные); 
	
КонецПроцедуры  


&НаКлиенте
Процедура ИзвещатьПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Извещать) Тогда 
		Данные = ГрузоотправителиИГрузополучателиПолучитьДанные(Объект.Извещать);
		ЗаполнитьНаименованиеИАдрес("Извещать", Данные); 
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ИзвещатьЗаполнитьДанные(Команда)
	
	Данные = ГрузоотправителиИГрузополучателиПолучитьДанные(Объект.Извещать);
	ЗаполнитьНаименованиеИАдрес("Извещать", Данные); 
	
КонецПроцедуры

&НаКлиенте
Процедура ДоставкаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Доставка) Тогда 
		Данные = ГрузоотправителиИГрузополучателиПолучитьДанные(Объект.Доставка);
		ЗаполнитьНаименованиеИАдрес("Доставка", Данные);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ДоставкаЗаполнитьДанные(Команда)
	
	Данные = ГрузоотправителиИГрузополучателиПолучитьДанные(Объект.Доставка);
	ЗаполнитьНаименованиеИАдрес("Доставка", Данные);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ГрузоотправителиИГрузополучателиПолучитьДанные(Источник) 
	
	Структура = Новый Структура;
	Структура.Вставить("ПолноеНаименование", 	Источник.ПолноеНаименование);
	Структура.Вставить("ЮридическийАдрес", 		Источник.ЮридическийАдрес);
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьНаименованиеИАдрес(ИмяРеквизита, Данные) 
	
	Объект[ИмяРеквизита+"Наименование"] = Данные.ПолноеНаименование;
	Объект[ИмяРеквизита+"Адрес"] 		= Данные.ЮридическийАдрес;
	
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать элемент!");
		Отказ = истина;
		Возврат;
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Для создания грузоперевозки требуется обязательное заполнение клиента!",,
		"Контрагент",
		"Объект", 
		Отказ);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипКоносамента) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Для создания грузоперевозки требуется обязательное заполнение типа коносамента!",,
		"ТипКоносамента",
		"Объект", 
		Отказ);
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Объект.ТипПеревозки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Для создания грузоперевозки требуется обязательное заполнение типа перевозки!",,
		"ТипПеревозки",
		"Объект", 
		Отказ);
	КонецЕсли;  
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЗначенияЗаполнения = Новый Структура;
	ЗначенияЗаполнения.Вставить("Коносамент", Объект.Ссылка);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ЗначенияЗаполнения", ЗначенияЗаполнения);
	
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаОбъекта", СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		ПоказатьПредупреждение(, "Необходимо записать элемент!");
		Возврат;
	КонецЕсли; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Записать", Модифицированность);
	
	Оповещение = Новый ОписаниеОповещения("ПередСозданиемЗаказа", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Модифицированность Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Коносамент будет записан. Продолжить?", Режим, 0); 
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ПередСозданиемЗаказа(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;  
	
	Если ДополнительныеПараметры.Записать Тогда   
		ЭтотОбъект.Записать();
	КонецЕсли;    
	
	ЕстьЗаказыКоносамента = ЕстьЗаказыКоносамента();
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьСозданиеЗаказа", ЭтотОбъект);
	
	Если ЕстьЗаказыКоносамента Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "По коносаменту уже существует заказ(ы). Продолжить?", Режим, 0);
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры          

&НаКлиенте
Процедура ПродолжитьСозданиеЗаказа(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;                                                             
	КонецЕсли;                                                                
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Для создания заказа требуется обязательное заполнение клиента!",,
		"Контрагент",
		"Объект");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.ТипПеревозки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		"Для создания заказа требуется обязательное заполнение типа перевозки!",,
		"ТипПеревозки",
		"Объект"); 
		Возврат;
	КонецЕсли;  
	
	Если Не ЗначениеЗаполнено(Объект.Наименование) 
		И Не ЗначениеЗаполнено(Объект.Букинг) Тогда  
		
		Если Не ЗначениеЗаполнено(Объект.Наименование) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Для создания заказа требуется обязательное заполнение номера коносамента!",,
			"Наименование",
			"Объект"); 
			Возврат;
		КонецЕсли;  
		
		Если Не ЗначениеЗаполнено(Объект.Букинг) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			"Для создания заказа требуется обязательное заполнение букинга коносамента!",,
			"Букинг",
			"Объект"); 
			Возврат;
		КонецЕсли;  
	КонецЕсли;  
	
	МассивГрузоперевозок = ПолучитьСписокЗаказовКоносамента();
	Если МассивГрузоперевозок.Количество() = 0 Тогда
		ПоказатьПредупреждение(, "Для создания заказа требуется выбрать хотя бы одну грузоперевозку!");
		Возврат;
	КонецЕсли;     
	
	СтруктураОтбора = Новый Структура;
	СтруктураОтбора.Вставить("Ссылка", МассивГрузоперевозок);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", СтруктураОтбора);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", Истина);
	
	Оповещение = Новый ОписаниеОповещения("ПослеВыбораГрузоперевозок", ЭтотОбъект);
	
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора", СтруктураПараметров, ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры     

&НаКлиенте
Процедура ПослеВыбораГрузоперевозок(РезультатВыбора, ДополнительынеПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаказСсылка = СоздатьЗаказНаСервере(РезультатВыбора);  
	
	Элементы.Заказы.Обновить();
	
	Если ЗаказСсылка <> Неопределено Тогда
		ПоказатьЗначение(,ЗаказСсылка);       
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция СоздатьЗаказНаСервере(МассивГрузоперевозок)
	
	НовыйЗаказ = Справочники.CW_Заказы.СоздатьЭлемент();
	НовыйЗаказ.Наименование = ?(ПустаяСтрока(Объект.Наименование), Объект.Букинг, Объект.Наименование);
	НовыйЗаказ.Коносамент   = Объект.Ссылка;
	НовыйЗаказ.ДатаСделкиФ  = Объект.Дата;
	НовыйЗаказ.ТипПеревозки = Объект.ТипПеревозки;
	НовыйЗаказ.Клиент		= Объект.Контрагент;
	НовыйЗаказ.Заявка		= Объект.Заявка;
	
	МенеджерПродаж = Объект.Заявка.МенеджерПродаж;
	Если Не ЗначениеЗаполнено(МенеджерПродаж) Тогда
		МенеджерПродаж = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойМенеджерПродаж");
	КонецЕсли;
	
	НовыйЗаказ.МенеджерПродаж = МенеджерПродаж;      
	НовыйЗаказ.ОперативныйМенеджер = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойОперативныйМенеджер");
	
	НовыйЗаказ.Маршрут = Объект.Заявка.Маршрут;
	НовыйЗаказ.Груз = Объект.Заявка.Груз;
	
	НовыйЗаказ.ГруппыПараметровЗаказа.Загрузить(НовыйЗаказ.ТипПеревозки.ГруппыПараметровЗаказа.Выгрузить());
	НовыйЗаказ.ПараметрыЗаказа.Загрузить(НовыйЗаказ.ТипПеревозки.ПараметрыЗаказа.Выгрузить());
	
	_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(НовыйЗаказ, НовыйЗаказ.ТипПеревозки, "ДляЗаказа"); 
	
	СтруктураПараметров = CW_Мониторинг.ПолучитьПредопределенныеПараметры(НовыйЗаказ.ТипПеревозки,"ТипПеревозки", Новый УникальныйИдентификатор);
	Если СтруктураПараметров.Код = 0 Тогда
		CW_Мониторинг.ДобавитьПредопределенныеПараметры(НовыйЗаказ, СтруктураПараметров.Параметры);
	КонецЕсли;
	
	СоответствияИменРеквизитов = Перечисления.CW_РеквизитыКоносамента.ПолучитьСоответствияИменРеквизитов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СоответствиеРеквизитовПараметрам.РеквизитКоносамента КАК РеквизитКоносамента,
	|	СоответствиеРеквизитовПараметрам.ИмяРеквизита КАК ИмяРеквизита,
	|	СоответствиеРеквизитовПараметрам.ПараметрОбъекта КАК Параметр
	|ИЗ
	|	Справочник.CW_ТипыКоносаментов.СоответствиеРеквизитовМониторинговымПараметрам КАК СоответствиеРеквизитовПараметрам
	|ГДЕ
	|	СоответствиеРеквизитовПараметрам.Ссылка = &ТипКоносамента
	|	И СоответствиеРеквизитовПараметрам.КопироватьВЗаказы = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТипКоносамента", Объект.ТипКоносамента);
	
	Коносамент = Объект.Ссылка;
	МетаданныеКоносамента = Коносамент.Метаданные();
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИмяРеквизита = СоответствияИменРеквизитов.Получить(Выборка.РеквизитКоносамента);  
		Если МетаданныеКоносамента.Реквизиты.Найти(ИмяРеквизита) = Неопределено
			и МетаданныеКоносамента.ТабличныеЧасти.ГрузовыеЕдиницы.Реквизиты.Найти(ИмяРеквизита) = Неопределено
			и Выборка.РеквизитКоносамента <> Перечисления.CW_РеквизитыКоносамента.НомерКоносамента Тогда
			Продолжить;
		КонецЕсли;
		
		Если МетаданныеКоносамента.ТабличныеЧасти.ГрузовыеЕдиницы.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
			Выражение = "Коносамент[ИмяРеквизита]";
			Если Не ПустаяСтрока(Выборка.ИмяРеквизита) Тогда
				Выражение = Выражение + "."+СокрЛП(Выборка.ИмяРеквизита);
			КонецЕсли; 
			
			ЗначениеРеквизита = Вычислить(Выражение); 
		КонецЕсли;
		
		НайденаняСтрока = НовыйЗаказ.ПараметрыЗаказа.Найти(Выборка.Параметр, "Параметр");
		Если НайденаняСтрока = Неопределено Тогда
			НоваяСтрока = НовыйЗаказ.ПараметрыЗаказа.Добавить();
			НоваяСтрока.Параметр = Выборка.Параметр;   
		КонецЕсли;
		НоваяСтрока.Значение = ЗначениеРеквизита;
	КонецЦикла;
	
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_МониторинговыеПараметрыТиповОбъектов.Параметр КАК Параметр
	|ПОМЕСТИТЬ ВТ_ДобавляемыеПараметры
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыТиповОбъектов КАК CW_МониторинговыеПараметрыТиповОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыТиповОбъектов.Владелец = &ТипКоносамента
	|	И CW_МониторинговыеПараметрыТиповОбъектов.КопироватьВЗаказы = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_МониторинговыеПараметрыОбъектов.Параметр КАК Параметр,
	|	CW_МониторинговыеПараметрыОбъектов.Значение КАК Значение,
	|	CW_МониторинговыеПараметрыОбъектов.ЗначениеПлан КАК ЗначениеПлан,
	|	CW_МониторинговыеПараметрыОбъектов.ЗначениеФакт КАК ЗначениеФакт
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыОбъектов КАК CW_МониторинговыеПараметрыОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыОбъектов.Владелец = &Коносамент
	|	И CW_МониторинговыеПараметрыОбъектов.Параметр В
	|			(ВЫБРАТЬ
	|				ВТ_ДобавляемыеПараметры.Параметр КАК Параметр
	|			ИЗ
	|				ВТ_ДобавляемыеПараметры КАК ВТ_ДобавляемыеПараметры)";
	
	Запрос.УстановитьПараметр("Коносамент", 	Коносамент);
	Запрос.УстановитьПараметр("ТипКоносамента", Коносамент.ТипКоносамента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() ЦИкл
		НайденаняСтрока = НовыйЗаказ.ПараметрыЗаказа.Найти(Выборка.Параметр, "Параметр");
		Если НайденаняСтрока = Неопределено Тогда
			НоваяСтрока = НовыйЗаказ.ПараметрыЗаказа.Добавить();
			НоваяСтрока.Параметр = Выборка.Параметр;         
		КонецЕсли;
		НоваяСтрока.Значение = Выборка.Значение;
		НоваяСтрока.ЗначениеПлан = Выборка.ЗначениеПлан;
		НоваяСтрока.ЗначениеФакт = Выборка.ЗначениеФакт;
	КонецЦикла;
	
	Попытка
		НовыйЗаказ.Записать();
	Исключение
		Сообщить(ОписаниеОшибки());
		Возврат Неопределено;
	КонецПопытки; 
	
	
	Для Каждого Грузоперевозка из МассивГрузоперевозок Цикл
		ГрузопереовзкаОбъект = Грузоперевозка.ПолучитьОбъект();
		ГрузопереовзкаОбъект.Заказ = НовыйЗаказ.Ссылка;
		ГрузопереовзкаОбъект.Записать();
	КонецЦикла;

    Возврат НовыйЗаказ.Ссылка;

КонецФункции

&НаСервере
Функция ПолучитьСписокЗаказовКоносамента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_Грузоперевозки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Коносамент = &Коносамент
	|	И CW_Грузоперевозки.Заказ = ЗНАЧЕНИЕ(Справочник.CW_Заказы.ПустаяСсылка)"; 
	
	Запрос.УстановитьПараметр("Коносамент", Объект.Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаСервере
Функция ЕстьЗаказыКоносамента()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_Заказы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_Заказы КАК CW_Заказы
	|ГДЕ
	|	CW_Заказы.Коносамент = &Коносамент";  
	
	Запрос.УстановитьПараметр("Коносамент", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

&НаКлиенте
Процедура ГрузовыеЕдиницыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ТекущиеДанные = Элементы.ГрузовыеЕдиницы.ТекущиеДанные;
		ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;   
		ТекущиеДанные.Груз = ПолучитьГруз();
		
		Если Копирование Тогда
			ТекущиеДанные.СписокГрузоперевозок.Очистить();
			ТекущиеДанные.СписокГрузоперевозокСтрокой = "";	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаКлиенте
Процедура ГрузовыеЕдиницыПередУдалением(Элемент, Отказ) 
	
	ВыделенныеСтроки = Элементы.ГрузовыеЕдиницы.ВыделенныеСтроки;
	
	Отказ = Истина; 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ПродолжитьУдалениеСтрокГрузовыхЕдиниц", ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьВопрос(Оповещение, "Выделенные строки будут удалены. Продолжить?", Режим, 0);	
	
КонецПроцедуры    

&НаКлиенте
Процедура ПродолжитьУдалениеСтрокГрузовыхЕдиниц(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;        
	
	ЕстьЗаписи = ЕстьЗаписиРегистраCоответствиеГрузоперевозокСтрокамКоносаментов(ДополнительныеПараметры.ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ЕщеРазПродолжитьУдалениеСтрокГрузовыхЕдиниц", ЭтотОбъект, ДополнительныеПараметры);
	Если ЕстьЗаписи Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "С выделенными строками найдены связанные грузоперевозки. Связь грузоперевозок со сторами будет разорвана. Продолжить?", Режим, 0);	
	Иначе
		УдалениеСтрокГрузовыхЕдиницНаСерере(ДополнительныеПараметры.ВыделенныеСтроки)
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ЕщеРазПродолжитьУдалениеСтрокГрузовыхЕдиниц(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;        
	
	ПродолжитьУдалениеСтрокГрузовыхЕдиницНаСерере(ДополнительныеПараметры.ВыделенныеСтроки);
	
КонецПроцедуры  

&НаСервере
Процедура УдалениеСтрокГрузовыхЕдиницНаСерере(ВыделенныеСтроки)
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ИдентификаторСтроки);	
		Объект.ГрузовыеЕдиницы.Удалить(СтрокаТаблицы) 
	КонецЦикла;
	
КонецПроцедуры  


&НаСервере
Процедура ПродолжитьУдалениеСтрокГрузовыхЕдиницНаСерере(ВыделенныеСтроки) 
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ИдентификаторСтроки);	
		
		КлючРегистра = Новый Структура;
		КлючРегистра.Вставить("Коносамент", 			Объект.Ссылка);
		КлючРегистра.Вставить("Грузоперевозка", 		СтрокаТаблицы.Грузоперевозка);
		КлючРегистра.Вставить("ИдентификаторСтроки",	СтрокаТаблицы.ИдентификаторСтроки);
		
		ЗаписьРегистра = РегистрыСведений.CW_ГрузоперевозкиКоносаментов.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ЗаписьРегистра, КлючРегистра);
		
		Если ЗаписьРегистра.Прочитать() Тогда
			ЗаписьРегистра.Удалить();
		КонецЕсли;
		
		Объект.ГрузовыеЕдиницы.Удалить(СтрокаТаблицы) 
		
	КонецЦикла;
	
КонецПроцедуры  

&НаСервере
Функция ЕстьЗаписиРегистраCоответствиеГрузоперевозокСтрокамКоносаментов(ВыделенныеСтроки) 
	
	МассивСтроки = Новый Массив;
	
	Для Каждого ИдентификаторСтроки из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ИдентификаторСтроки);	
		МассивСтроки.Добавить(СтрокаТаблицы.ИдентификаторСтроки);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	CW_ГрузоперевозкиКоносаментов.Грузоперевозка КАК Грузоперевозка
	|ИЗ
	|	РегистрСведений.CW_ГрузоперевозкиКоносаментов КАК CW_ГрузоперевозкиКоносаментов
	|ГДЕ
	|	CW_ГрузоперевозкиКоносаментов.ИдентификаторСтроки в (&МассивСтроки)";  
	
	Запрос.УстановитьПараметр("МассивСтроки", МассивСтроки); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции 

&НаСервере
Функция ПолучитьГруз()
	
	УчетГруза = ПолучитьФункциональнуюОпциюФормы("CW_КоносаментыУчетГруза");
	УчетЗаявок = ПолучитьФункциональнуюОпциюФормы("CW_КоносаментыУчетЗаявок");
	
	Если УчетЗаявок и УчетГруза 
		И ЗначениеЗаполнено(Объект.Заявка) Тогда
		Возврат Объект.Заявка.Груз;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура СоздатьГрузоперевозки(Команда) 
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Записать", Модифицированность);
	
	Оповещение = Новый ОписаниеОповещения("ПередСозданиемГрузоперевозок", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Модифицированность Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Коносамент будет записан. Продолжить?", Режим, 0); 
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да); 
	КонецЕсли;
	
КонецПроцедуры    

&НаКлиенте
Процедура ПередСозданиемГрузоперевозок(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;  
	
	Если ДополнительныеПараметры.Записать Тогда
		ЭтотОбъект.Записать();
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.ГрузовыеЕдиницы.ВыделенныеСтроки;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ВыделенныеСтроки", ВыделенныеСтроки);
	
	Оповещение = Новый ОписаниеОповещения("ПродолжитьСозданиеГрузоперевозок", ЭтотОбъект, ДополнительныеПараметры);
	
	Режим = РежимДиалогаВопрос.ДаНет;
	ПоказатьВопрос(Оповещение, "Для выеделенных строк будут созданы грузоперевозки. Продолжить?", Режим, 0); 
	
КонецПроцедуры    

&НаКлиенте
Процедура ПродолжитьСозданиеГрузоперевозок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;  
	
	Результат = СоздатьГрузоперевозкиНаСервере(ДополнительныеПараметры.ВыделенныеСтроки);
	
	Если Результат.Создано <> 0 Тогда 
		ПоказатьПредупреждение(, "Создано грузоперевозок: "+Формат(Результат.Создано,"ЧГ=0"));
	КонецЕсли;
	Если Результат.НомераСтрок.Количество() > 0 Тогда 
		ПоказатьПредупреждение(, "При формировании грузоперевозок возникла ошибка!");  
		Для каждого НомерСтроки из Результат.НомераСтрок Цикл
			Сообщить("Не удалось сформировать грузоперевозку по строке "+Формат(НомерСтроки,"ЧГ=0")+"!");	
		КонецЦикла;
	КонецЕсли;
	
	Элементы.Грузоперевозки.Обновить();
	
КонецПроцедуры   

&НаСервере
Функция СоздатьГрузоперевозкиНаСервере(ВыделенныеСтроки)
	
	Результат = Новый Структура("Создано,НомераСтрок",0,Новый Массив);
	
	МассивИдентификаторовСтрок = Новый Массив; 
	Для каждого ВыделеннаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		МассивИдентификаторовСтрок.Добавить(СтрокаТаблицы.ИдентификаторСтроки);
	КонецЦикла;   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ГрузоперевозкиКоносаментов.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ИЗ
	|	РегистрСведений.CW_ГрузоперевозкиКоносаментов КАК CW_ГрузоперевозкиКоносаментов
	|ГДЕ
	|	CW_ГрузоперевозкиКоносаментов.ИдентификаторСтроки В(&МассивИдентификаторовСтрок)";
	
	Запрос.УстановитьПараметр("МассивИдентификаторовСтрок", МассивИдентификаторовСтрок);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() 
		и МассивИдентификаторовСтрок.Количество() > 0 Цикл
		МассивИдентификаторовСтрок.Удалить(МассивИдентификаторовСтрок.Найти(Выборка.ИдентификаторСтроки));
	КонецЦикла;   
	
	Если МассивИдентификаторовСтрок.Количество() = 0 Тогда  
		Для каждого ВыделеннаяСтрока из ВыделенныеСтроки Цикл
			СтрокаТаблицы = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ВыделеннаяСтрока);
			Результат.НомераСтрок.Добавить(СтрокаТаблицы.НомерСтроки);
		КонецЦикла;
		Возврат Результат;
	КонецЕсли;  
	
	ГрузовыеЕдиницы = Объект.ГрузовыеЕдиницы.Выгрузить(); //ну куда же без этого
	
	Для Каждого ИдентификаторСтроки из МассивИдентификаторовСтрок Цикл
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИдентификаторСтроки", ИдентификаторСтроки);
		
		мГрузовыеЕдиницы= Объект.ГрузовыеЕдиницы.НайтиСтроки(Отбор);;  
		Если мГрузовыеЕдиницы.количество() = 0 Тогда
			Продолжить;
		КонецЕсли;  
		
		НайденнаяСтрока = мГрузовыеЕдиницы[0]; 
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Коносамент", 	 Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("СтрокаТаблицы", НайденнаяСтрока);
		
		НоваяГрузопереовозка = Справочники.CW_Грузоперевозки.СоздатьЭлемент();
		НоваяГрузопереовозка.Заполнить(ЗначенияЗаполнения);
		
		НоваяГрузопереовозка.CW_Представление = НайденнаяСтрока.НаименованиеГрузовойЕдиницы;
		НоваяГрузопереовозка.ДатаСделкиФ = Объект.Дата;
		НоваяГрузопереовозка.Наименование = НайденнаяСтрока.НаименованиеГрузовойЕдиницы;
		НоваяГрузопереовозка.Типоразмер   = НайденнаяСтрока.Типоразмер;
		
		Попытка
			НоваяГрузопереовозка.Записать();  
			Результат.Создано = Результат.Создано + 1;
		Исключение 
			Результат.НомераСтрок.Добавить(НайденнаяСтрока.НомерСтроки);
			Продолжить;
		КонецПопытки;
		
		ЗаписьРегистра = РегистрыСведений.CW_ГрузоперевозкиКоносаментов.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Грузоперевозка = НоваяГрузопереовозка.Ссылка;
		ЗаписьРегистра.Коносамент = Объект.Ссылка;
		ЗаписьРегистра.ИдентификаторСтроки = ИдентификаторСтроки;
		ЗаписьРегистра.Записать();
		
	КонецЦикла;
	
	Для каждого ВыделеннаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТаблицы = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ВыделеннаяСтрока);
		ЗаполнитьСписокГрузопереозвокПоСтроке(СтрокаТаблицы); 
	КонецЦикла;   
	
	Возврат Результат;
	
КонецФункции


&НаКлиенте
Процедура ОбновитьГрузоперевозки(Команда)   
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Записать", Модифицированность);
	
	Оповещение = Новый ОписаниеОповещения("ПередВыполнениемОбновитьГрузоперевозки", ЭтотОбъект, ДополнительныеПараметры);
	
	Если Модифицированность Тогда 
		Режим = РежимДиалогаВопрос.ДаНет;
		ПоказатьВопрос(Оповещение, "Коносамент будет записан. Продолжить?", Режим, 0); 
	Иначе
		ВыполнитьОбработкуОповещения(Оповещение, КодВозвратаДиалога.Да); 
	КонецЕсли;
	
	
КонецПроцедуры   


&НаКлиенте
Процедура ПередВыполнениемОбновитьГрузоперевозки(Результат, ДополнительныеПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда   
		ПоказатьПредупреждение(, "Произошла ошибка. Данные грузоперевозок не обновлены!");
		Возврат;
	КонецЕсли;  
	
	Если ДополнительныеПараметры.Записать Тогда 
		Попытка
			ЭтотОбъект.Записать();
		Исключение
			ПоказатьПредупреждение(, "Произошла ошибка. Данные грузоперевозок не обновлены!");
		КонецПопытки;
	КонецЕсли;
	
	ВыделенныеСтроки = Элементы.ГрузовыеЕдиницы.ВыделенныеСтроки;
	
	Успешно = ОбновитьГрузоперевозкиНаСервере(ВыделенныеСтроки);
	Если Успешно Тогда
		ПоказатьПредупреждение(, "Данные грузоперевозок обновлены!");	
	КонецЕсли;
	
КонецПроцедуры  

&НаСервере
Функция ОбновитьГрузоперевозкиНаСервере(ВыделенныеСтроки)
	
	Для Каждого ТекущаяСтрока из ВыделенныеСтроки Цикл
		СтрокаТекущая = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ТекущаяСтрока);                                  
		
		ЗначенияЗаполнения = Новый Структура;
		ЗначенияЗаполнения.Вставить("Коносамент", 	 Объект.Ссылка);
		ЗначенияЗаполнения.Вставить("СтрокаТаблицы", СтрокаТекущая);
		
		Для Каждого ЭлементСписка из СтрокаТекущая.СписокГрузоперевозок Цикл  
			ГрузоперевозкаОбъект = ЭлементСписка.Значение.ПолучитьОбъект();
			ГрузоперевозкаОбъект.Заполнить(ЗначенияЗаполнения);
			
			ГрузоперевозкаОбъект.CW_Представление = СтрокаТекущая.НаименованиеГрузовойЕдиницы;
			ГрузоперевозкаОбъект.ДатаСделкиФ = Объект.Дата;
			ГрузоперевозкаОбъект.Наименование = СтрокаТекущая.НаименованиеГрузовойЕдиницы;
			ГрузоперевозкаОбъект.Типоразмер   = СтрокаТекущая.Типоразмер;
			
			ГрузоперевозкаОбъект.Записать();
		КонецЦикла;
	КонецЦикла;  
	
	УстановитьСписокГрузоперевозокВСтроки();  
	
	Возврат Истина;
	
КонецФункции    

&НаСервере
Процедура УстановитьСписокГрузоперевозокВСтроки()  
	
	Для каждого СтрокаТаблицы из Объект.ГрузовыеЕдиницы Цикл
		ЗаполнитьСписокГрузопереозвокПоСтроке(СтрокаТаблицы); 
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Процедура ЗаполнитьСписокГрузопереозвокПоСтроке(СтрокаТаблицы)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ГрузоперевозкиКоносаментов.Грузоперевозка КАК Грузоперевозка
	|ИЗ
	|	РегистрСведений.CW_ГрузоперевозкиКоносаментов КАК CW_ГрузоперевозкиКоносаментов
	|ГДЕ
	|	CW_ГрузоперевозкиКоносаментов.Коносамент = &Коносамент
	|	И CW_ГрузоперевозкиКоносаментов.ИдентификаторСтроки = &ИдентификаторСтроки";  
	
	Запрос.УстановитьПараметр("Коносамент", Объект.Ссылка);
	Запрос.УстановитьПараметр("ИдентификаторСтроки", СтрокаТаблицы.ИдентификаторСтроки);     
	
	РезультатЗапроса = Запрос.Выполнить();
	
	МассивГрузоперевозок = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	
	СтрокаТаблицы.СписокГрузоперевозок.ЗагрузитьЗначения(МассивГрузоперевозок);  
	СтрокаТаблицы.СписокГрузоперевозокСтрокой = СтрСоединить(МассивГрузоперевозок, ", ");
	
КонецПроцедуры 


&НаКлиенте
Процедура ГрузовыеЕдиницыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ГрузовыеЕдиницыСписокГрузоперевозокСтрокой" Тогда
		СтандартнаяОбработка = Ложь;  
		
		СписокГрузоперевозок = ПолучитьСписокГрузоперевозок(ВыбраннаяСтрока);
		Если СписокГрузоперевозок.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		Оповещение = Новый ОписаниеОповещения("ПослеВыбораГрузоперевозкиИзСписка", ЭтотОбъект);
		Если СписокГрузоперевозок.Количество() = 1 Тогда   
			ЭлементСписка = СписокГрузоперевозок.Получить(0);   
			ВыполнитьОбработкуОповещения(Оповещение,ЭлементСписка); 
		Иначе    
			СписокГрузоперевозок.ПоказатьВыборЭлемента(Оповещение, "ВЫбор грузоперевозки");
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры     

&НаКлиенте
Процедура ПослеВыбораГрузоперевозкиИзСписка(ЭлементСписка, ДополнительныеПараметры) Экспорт
	
	Если ЭлементСписка = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение(,ЭлементСписка.Значение);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокГрузоперевозок(ВыбраннаяСтрока)
	
	СтрокаТаблицы = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ВыбраннаяСтрока);  
	Возврат СтрокаТаблицы.СписокГрузоперевозок;
	
КонецФункции

//Наличие прикрепленных файлов
&НаСервере
Процедура ОбработатьОповещениеОбновитьНаличиеПрикрепленныхФайлов()
	
	CW_РаботаСФайламиСервер.УстановитьНаличиеПрикрепленныхФайловПриСозданииФормыНаСервере(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловНажатие(Элемент, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловНажатие(ЭтаФорма, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	СтандартнаяОбработка  = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура АдресКартинкиФайловПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	CW_РаботаСФайламиКлиент.АдресКартинкиФайловПеретаскивание(ЭтаФорма, ПараметрыПеретаскивания, СтандартнаяОбработка);
	
КонецПроцедуры
//Наличие прикрепленных файлов

&НаКлиенте
Процедура СвязатьСГрузоперевозкой(Команда)  
	
	МассивГрузоперевозок = ПолучитьСписокГрузоперевозокКоносамента();
	
	Отбор = Новый Структура;
	Отбор.Вставить("Ссылка", МассивГрузоперевозок);
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("Отбор", Отбор);
	СтруктураПараметров.Вставить("ЗакрыватьПриВыборе", ложь);
	СтруктураПараметров.Вставить("МножественныйВыбор", Истина);
	
	ОткрытьФорму("Справочник.CW_Грузоперевозки.ФормаВыбора", СтруктураПараметров, Элементы.ГрузовыеЕдиницы,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьСписокГрузоперевозокКоносамента() 
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ГрузоперевозкиКоносаментов.Грузоперевозка КАК Грузоперевозка
	|ПОМЕСТИТЬ ВТ_ПривязанныеГрузоперевозки
	|ИЗ
	|	РегистрСведений.CW_ГрузоперевозкиКоносаментов КАК CW_ГрузоперевозкиКоносаментов
	|ГДЕ
	|	CW_ГрузоперевозкиКоносаментов.Коносамент = &Коносамент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_Грузоперевозки.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	|ГДЕ
	|	CW_Грузоперевозки.Коносамент = &Коносамент
	|	И НЕ CW_Грузоперевозки.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ПривязанныеГрузоперевозки.Грузоперевозка КАК Грузоперевозка
	|				ИЗ
	|					ВТ_ПривязанныеГрузоперевозки КАК ВТ_ПривязанныеГрузоперевозки)"; 
	
	Запрос.УстановитьПараметр("Коносамент", Объект.Ссылка); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

&НаКлиенте
Процедура ГрузовыеЕдиницыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;   
	ТекущаяСтрока= Элементы.ГрузовыеЕдиницы.ТекущаяСтрока;
	ГрузовыеЕдиницыОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущаяСтрока);
	
	Элементы.Грузоперевозки.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ГрузовыеЕдиницыОбработкаВыбораНаСервере(ВыбранноеЗначение, ТекущаяСтрока)
	
	СтрокаТекущая = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ТекущаяСтрока);
	
	Для Каждого Грузоперевозка из ВыбранноеЗначение Цикл
		ЗаписьРегистра = РегистрыСведений.CW_ГрузоперевозкиКоносаментов.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Грузоперевозка = Грузоперевозка;
		ЗаписьРегистра.Коносамент = Объект.Ссылка;
		ЗаписьРегистра.ИдентификаторСтроки = СтрокаТекущая.ИдентификаторСтроки;
		ЗаписьРегистра.Записать();
	КонецЦикла;  
	
	ЗаполнитьСписокГрузопереозвокПоСтроке(СтрокаТекущая); 
	
КонецПроцедуры

&НаКлиенте
Процедура ОтвязатьОтСтроки(Команда)
	
	ТекущаяСтрока = Элементы.ГрузовыеЕдиницы.ТекущаяСтрока; 
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СписокГрузоперевозок = ПолучитьСписокГрузоперевозок(ТекущаяСтрока);
	Если СписокГрузоперевозок.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ТекущаяСтрока", ТекущаяСтрока);
	
	Оповещение = Новый ОписаниеОповещения("ПослеОтметкиГрузоперевозок", ЭтотОбъект, ДополнительныеПараметры);
	СписокГрузоперевозок.ПоказатьОтметкуЭлементов(Оповещение, "Выбор грузоперевозок");
	
КонецПроцедуры  

&НаКлиенте
Процедура ПослеОтметкиГрузоперевозок(СписокГрузоперевозок, ДополнительныеПараметры) Экспорт    
	
	Если СписокГрузоперевозок = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	
	ОтвязатьОтСтрокиНаСервере(СписокГрузоперевозок, ДополнительныеПараметры.ТекущаяСтрока);
	
КонецПроцедуры   


&НаСервере
Процедура ОтвязатьОтСтрокиНаСервере(СписокГрузоперевозок, ТекущаяСтрока)    
	
	СтрокаТекущая = Объект.ГрузовыеЕдиницы.НайтиПоИдентификатору(ТекущаяСтрока); 
	
	Для Каждого ЭлементСписка из СписокГрузоперевозок Цикл
		Если Не ЭлементСписка.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		ЗаписьРегистра = РегистрыСведений.CW_ГрузоперевозкиКоносаментов.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.Грузоперевозка = ЭлементСписка.Значение;
		ЗаписьРегистра.Коносамент = Объект.Ссылка;
		ЗаписьРегистра.ИдентификаторСтроки = СтрокаТекущая.ИдентификаторСтроки;
		
		ЗаписьРегистра.Прочитать();
		
		Если ЗаписьРегистра.Выбран() Тогда
			ЗаписьРегистра.Удалить();
		КонецЕсли;
		
	КонецЦикла;
	
	ЗаполнитьСписокГрузопереозвокПоСтроке(СтрокаТекущая); 
	
КонецПроцедуры

//Переводы
&НаКлиенте
Процедура ПереводОтправительНаименование(Команда) 

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ОтправительНаименование");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПереводОтправительАдрес(Команда)

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ОтправительАдрес");
	
КонецПроцедуры
 
&НаКлиенте
Процедура ПереводПолучательНаименование(Команда)

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ПолучательНаименование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводПолучательАдрес(Команда)

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ПолучательАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводИзвещатьНаименование(Команда)

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ИзвещатьНаименование");
	
КонецПроцедуры 

&НаКлиенте
Процедура ПереводИзвещатьАдрес(Команда)

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ИзвещатьАдрес");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводДоставкаНаименование(Команда)

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ДоставкаНаименование");
	
КонецПроцедуры

&НаКлиенте
Процедура ПереводДоставкаАдрес(Команда)

	CW_ПереводыКлиент.ОткрытьФормуПеревода(ЭтаФорма, Объект.Ссылка, "ДоставкаАдрес");
	
КонецПроцедуры
//переводы


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры


#КонецОбласти
